{"title": "Total War Warhammer 3 z NFT? Twórcy nie chcą, ale to SEGA zadecyduje", "date": "11 kwietnia 2022, 13:32", "summary": "Niewykluczone, że powstaną NFT związane z grą Total War: Warhammer 3. Studio Creative Assembly jest świadome złego nastawienia graczy do tokenów, ale wszelkie decyzje w tej sprawie podejmuje SEGA.", "text": "Total War: Warhammer III  pokazał moc gier strategicznych – bardziej na Steamie niż w Game Passie, gdzie miał drobne problemy – lecz jeden z bestsellerów pierwszego kwartału 2022 roku może wkrótce stracić w oczach graczy. Wszystko wskazuje na to, że  SEGA ma w planach wydanie NFT związanych z ową strategią. Co prawda żaden konkretny komunikat w tej sprawie jeszcze się nie pojawił, lecz słowa jednego z twórców , Marka Sinclaira ze studia Creative Assembly , mogą wzbudzić u fanów konsternację i niepokój. W wywiadzie dla hiszpańskiego serwisu 3djuegos.com (via PCGamesN.com ) stwierdził on, że zdaje sobie sprawę ze stosunku wydawcy, firmy SEGA, do NFT. Co więcej, deweloper wydaje się go nie podzielać, gdyż przyznał, iż rozumie różnice zdań i obawy graczy w tej kwestii. Jednak – jako że Creative Assembly należy do grupy SEGA – stanie się tak, jak postanowi właściciel. Stosunek SEGI do NFT stał się zaś raczej klarowny po tym, jak w styczniu 2022 roku – mimo wcześniejszych przeciwnych komunikatów – zarejestrowane zostały dwa znaki towarowe: „SEGA NFT” oraz „SEGA Classics NFT Collection”. Co więcej, włodarze przedsiębiorstwa najwyraźniej uważają tokeny za kolejny krok w rozwoju branży i zamierzają „wzbogacać” o nie wszystkie swoje przyszłe produkcje – w tym tajemniczą „Supergrę” , która może być czymś innym, niż do tej pory myśleliśmy.", "url": "https://www.gry-online.pl/newsroom/total-war-warhammer-3-z-nft-tworcy-nie-chca-ale-to-sega-zadecyduj/zb21a34"}
{"title": "Cyberpunk 2077 z trzeciej osoby ma sens, biorąc pod uwagę świat gry", "date": "11 kwietnia 2022, 13:42", "summary": "Pierwszoosobowy widok w Cyberpunku 2077 pozytywnie wpływa na immersję. Niektórzy gracze sądzą jednak, że CD Projekt RED powinno wprowadzić do gry kamerę TPP. Co więcej, miałoby to nawet sens w lore.", "text": "Spór graczy w sprawie tego, co jest lepsze – TPP czy FPP – chyba nigdy nie dobiegnie końca . Tę batalię toczy również społeczność Cyberpunka 2077, gdzie niektórzy gracze wciąż narzekają na brak widoku z trzeciej osoby . Jeden z użytkowników wskazał nawet, że takowa opcja miałaby sens w kontekście lore, więc co trzyma „Redów” przy kamerze pierwszoosobowej? Według tego, czym podzielił się THZpr0 , rozwiązanie problemu kamery trzecioosobowej mogłoby zostać dodane w postaci opcjonalnego przedmiotu do zakupu. Byłby nim nano-dron (podobne rozwiązanie obecne jest np. w grze MechWarrior Online ). , który po włączeniu podążałby za V, jednocześnie transmitując widok z kamery do Kiroshi (wszczepu optycznego) . Z kolei w momencie rozpoczęcia walki dron deaktywowałby się, dzięki czemu na barkach CDPR nie leżałby obowiązek tworzenia nowych animacji (co i tak przy opracowywaniu TPP byłoby w pewnym stopniu koniecznie). Oczywiście podążając ideą pomysłu THZpr0, gracze zaczęli podrzucać swoje sugestie dotyczące tego, co również powinien umożliwiać pełen wszczepów mózg V. W dość prześmiewczy sposób zasugerowana została opcja słuchania radia poza samochodem, której w podstawowej wersji gry nie znajdziemy. Remedium na część bolączek graczy są oczywiście mody, a nawet ich cała masa. Dlatego też, jeśli myślicie o zewnętrznym radiu , czy też wolicie słuchać swoich ulubionych piosenek , a niekoniecznie tych z gry, to moderzy służą pomocą. Nie da się zaprzeczyć, że pomysł THZpr0 brzmi całkiem sensownie , jednak pojawia się kwestia tego, czy naprawdę w potrzebny jest widok zza pleców naszej postaci. Wiele osób zwraca uwagę na fakt, że ludzie chcą po prostu, aby produkcja CDPR stała się drugim GTA V (ma to sens również wobec dyskusji na temat trybu multiplayer). Z drugiej strony mamy argumenty dotyczące immersji. W tej kwestii, poza VR, nie ma chyba lepszego rozwiązania niż właśnie widok pierwszoosobowy. Czymże byłby teraz bez modów? Na pewno mniej przystępną grą, a przynajmniej dla części graczy. Podobnie jak ma to miejsce w przypadku radia, moderzy zaopiekowali się również tymi, którzy wolą na swoją postać patrzeć z daleka. Idealnym rozwiązaniem jest tutaj modyfikacja JB – TPP MOD WIP third person , która dostosowana jest do najnowszej wersji Działa ona w pewnym sensie podobnie do wspomnianej wyżej sugestii THZpr0, ponieważ w momencie wyciągnięcia broni kamera wraca do swojej „pierwotnej pozycji”. Warto tutaj wspomnieć również o tym, że w niektórych przypadkach widok trzecioosobowy nie jest zwykłym widzimisię, a realnie może wpłynąć na odczucia graczy, którzy cierpią na chorobę symulatorową (objawia się bardzo podobnie do choroby lokomocyjnej). Tym, co poza modem może zadowolić zwolenników TPP jest fakt, że niedawno na stronie z ogłoszeniami pracy w CD Projekt RED pojawiła się oferta dla programisty kamery trzecioosobowej oraz trybu multiplayer . Zatem kto wie, czy w przyszłości do faktycznie nie zawita opcja wyboru innego widoku.", "url": "https://www.gry-online.pl/newsroom/cyberpunk-2077-z-trzeciej-osoby-ma-sens-biorac-pod-uwage-swiat-gr/ze21a37"}
{"title": "CountryCide - zachwycający mroczny mod do Dooma 2 z nową wersją", "date": "11 kwietnia 2022, 14:05", "summary": "Ukazała się wersja 1.1 wyśmienitego moda CountryCide. Projekt przenosi graczy do mrocznego, dieselpunkowego uniwersum wzbogaconego elementami mitologii Cthulhu.", "text": "Zespół TrenchWork wypuścił wersję 1.1 imponującego moda . Jest to strzelanka zbudowana na silniku GZDoom, która przenosi graczy do wyśmienicie opracowanego, autorskiego uniwersum, łączącego elementy futurystyczne z klimatem dieselpunka i mitologią Cthulhu. CountryCide – pobierz mod Do zagrania w będziecie potrzebowali trzech rzeczy. Pierwszą z nich jest sam mod. Drugą open-source’owy silnik GZDoom , a trzecią jakiś plik .WAD. Dobra nowina jest taka, że jako ten ostatni element mogą Wam posłużyć zarówno pliki z pierwszych dwóch części serii , jak i darmowej alternatywy w postaci Freedoom . W praktyce więc wszystko, czego potrzebujecie do zagrania w , możecie uzyskać za darmo. Wystarczy, że wrzucicie do folderu z GZDoom jeden z plików .WAD oraz plik .pk3 moda, a następnie przeciągniecie ten ostatni na GZDoom.exe. Mod jest prequelem większego projektu Trench Foot , który na razie dostępny jest jedynie w formie wczesnego dema. Do premiery jego pełnej wersji pozostał jeszcze szmat czasu, więc twórcy postanowili umilić nam oczekiwanie na niego, wypuszczając mniejszą produkcję w postaci . Akcja toczy się w ponurym, dieselpunkowym uniwersum. Główną inspiracją dla autorów było oblężenie planety Vraks w . W wcielamy się w fanatyka religijnego, należącego do zakonu tępiącego wrogów galaktycznego Kalifatu. Wojownik ten udaje się na wiejską prowincję, podążając za wizjami zesłanymi przez Boga, aby odnaleźć tam wyznawców plugawego kultu. To totalna konwersja, co oznacza, że autorzy podmienili dosłownie wszystko. Otrzymujemy zupełnie nowe bronie, mapy, przeciwników i obiekty w otoczeniu. Wszystko to jest wspaniale wykonane, a dzięki wykorzystaniu silnika prezentuje znacznie wyższy poziom graficzny niż . Do tego mocno zmodyfikowano rozgrywkę i ulepszono sterowanie. Autorom skutecznie udało się też wykreować atmosferę horroru, która staje się tym cięższa, im dalej zapędzamy się w kampanii. Oficjalna strona projektu Trench Foot CountryCide – pobierz mod Trench Foot – pobierz mod GZDoom – pobierz Freedoom – pobierz", "url": "https://www.gry-online.pl/newsroom/countrycide-zachwycajacy-mroczny-mod-do-dooma-2-z-nowa-wersja/zf21a38"}
{"title": "LEGO Wiedźmin w Novigradzie; fani marzą o oficjalnych zestawach z Geraltem [Aktualizacja]", "date": "11 kwietnia 2022, 14:17", "summary": "Wiedźmin jako zestaw LEGO nie wydaje się prawdopodobny, ale kto zabroni fanom marzyć (i tworzyć własne przygody kanciastego Geralta)?", "text": "Po sukcesie wpisu ze zdjęciem z LEGO Novigradu BrickPanda82 podzielił się kolejnym obrazkiem z klockowym wiedźminem . Tym razem Geralt przemierza ponure bagno, choć i tutaj ma towarzystwo (z rodzaju tych potwornych). Grafikę możecie obejrzeć poniżej. Klocki LEGO mają już 90 lat, ale nic nie zapowiada, by szał na nie miał przeminąć w najbliższym czasie. Od lat 90. XX wieku duńska marka rozbudza wyobraźnię potencjalnymi zestawami na licencji. Wtedy otrzymaliśmy drewnianą zabawkę LEGO Pluto oraz pierwsze zestawy inspirowane . Podobnych inicjatyw przybyło w pierwszych dwóch dekadach XX wieku, o czym świadczyły także kolejne  gry wideo  z LEGO  w tytule . To tylko zachęciło fanów do snucia marzeń na temat przyszłych crossoverów , a część z nich wzięła sprawy w swoje ręce. Na przykład użytkownik serwisu Reddit BrickPanda82, który przedstawił koncepcję LEGO na licencji serii Wiedźmin studia CD Projekt RED. Klockowy Geralt to nie pierwszy tego typu wpis BrickPanda82. Internauta z Węgier co rusz zamieszcza obrazki łączące LEGO z innymi markami, głownie w ramach już  istniejących  crossoverów . Warto wspomnieć, że twórca zwykle nie sięga po obróbkę cyfrową, w całości korzystając z klocków i innych fizycznych rekwizytów (albo zdjęć w przypadku tła). Jednak w tym przypadku twórca musiał zrobić wyjątek dla figurki Geralta – tekstury na torsie postaci dodał w Photoshopie. LEGO Wiedźmin okazał się kolejnym popularnym wpisem BrickPanda82, ale też rozbudził dyskusje na temat możliwości pojawienia się oficjalnych zestawów duńskich klocków z Geraltem. Niektórzy nawet rozmarzyli się na temat gry wideo łączącej obie marki. seria Horizon serii Adults Welcome Oczywiście w żaden sposób nie przeszkadza to fanom w łączeniu LEGO i na własną rękę – BrickPanda82 bynajmniej nie jest tu pionierem. Już w 2016 roku w serwisie YouTube pojawiła się animacja poklatkowa autorstwa Lukasa „ondrejkarola” Brinzy, w której Geralt i Lambert ruszają na nietypową misję ratunkową. Na potrzeby filmiku internauta zbudował własne wiedźmińskie figurki , które wykorzystał też w drugiej części swojej serii (oraz w pomniejszych projektach ). W sieci da się też znaleźć inne  osoby , które samodzielnie złożyły figurki Geralta, Yennefer i innych bohaterów wiedźmińskiego uniwersum. Zainteresowanie jest więc spore, choć – niestety – raczej nie przełoży się to na oficjalne inicjatywy LEGO. Chociaż… może w ramach akcji promocyjnej nowego Wiedźmina ?", "url": "https://www.gry-online.pl/newsroom/lego-wiedzmin-w-novigradzie-fani-marza-o-oficjalnych-zestawach-z/z5219cf"}
{"title": "Co trzeci gracz PlayStation z „platyną” w Elden Ring. Zebraliśmy najnowsze dane", "date": "11 kwietnia 2022, 15:21", "summary": "Co trzecia osoba grająca w Elden Ring na PlayStation zdobyła „platynę”. Czterech na dziesięciu graczy pokonało zaś najtrudniejszego bossa. Na Steamie jest nieco gorzej, ale również nieźle.", "text": "Och, Elden Ring . Tu mógłbym wstawić tabelę i zakończyć, bo liczby mówią same za siebie. Przyjrzyjmy się im jednak nieco bliżej – po raz trzeci, a co – gdyż po prostu nie można przejść obojętnie obok faktu, że w półtora miesiąca od premiery ponad 33% graczy PlayStation  zdobyło  „platynę” (komplet 42 osiągnięć) w najnowszej grze studia FromSoftware . Informacje te są tym bardziej godne uwagi, że jest produkcją dość trudną – może nie aż tak jak Sekiro: Shadows Die Twice , Bloodborne czy pierwsze „Soulsy” , ale potrafi dać w kość. Jest też dość długi. Dane serwisu HowLongToBeat.com wskazują, że dotarcie do jednego z trzech zakończeń zajmuje przeciętnemu graczowi około 50 godzin. Zrobienie wszystkiego natomiast – od 117 do 122 okrążeń zegara. Dla porównania – wydany tydzień wcześniej względnie łatwy i o połowę krótszy Horizon Forbidden West ( potrzeba ok. 27 godzin, by go ukończyć, i ok. 85h, by móc się pochwalić „platyną”) został „wymaksowany” przez 35,43% graczy PlayStation. Na tle innych gier FromSoftware (z których dane przywoływałem ostatnim razem ) wynik osiągnięty przez również robi wrażenie. Nieco mniejszy zachwyt wzbudzają rezultaty użytkowników Steama. Może to wynikać z faktu, że na PC sprzedało się do tej pory najwięcej egzemplarzy nowej gry Hidetaki Miyazakiego i spółki – przynajmniej w Unii Europejskiej. Pełne dane dotyczące zakończeń przedstawia poniższa tabela. Zakończenie  Gracze na Steamie, którzy do niego dotarli (7/14 marca / 11 kwietnia)  Gracze w PSN, którzy do niego dotarli (7/14 marca / 11 kwietnia)  Gwiezdne stulecie  2,8% / 7,8% / 19,2%   wzrost o 5 / 11,4 pp.  4,72% / 15,34% / 38,54%  wzrost o 10,62 / 18,2 pp.  Eldeński Władca  2% / 5,5% / 13,5%  wzrost o 3,5 / 8 pp.  4,75% / 14,97% / 37,01%   wzrost o 10,22 / 22,04 pp.  Władca Oszalałego Płomienia  0,9% / 3,1% 9%  wzrost o 2,2 / 5,9 pp.  4,41% / 14,05% / 35,59%  wzrost o 9,64 / 21,54 pp.  Eldeński Krąg („platyna”)  0,4% / 1,6% / 5,2%  wzrost o 1,2 / 3,6 pp.  3,83% / 12,89% / 33,18%  wzrost o 9,06 / 20,29 pp.  A jak wygląda kwestia bossów? Który z nich dał się graczom najbardziej we znaki? Na PC – Drakolicz Fortissax, którego na razie pokonało „zaledwie” 22,2% użytkowników Steama. Jeśli zaś chodzi o PlayStation, rządzi „szefowa”, a konkretnie Malenia, Ostrze Miquelli , niepokonana szermierka, przez wiele osób uważana za najtrudniejszego przeciwnika w . Warto też zwrócić uwagę, jak bardzo wzrosły wskaźniki procentowe poszczególnych osiągnięć – w niektórych przypadkach nawet o ponad 30 punktów procentowych (pp.) w porównaniu do danych sprzed około miesiąca. Gracze PlayStation wciąż zachowują sporą przewagę nad użytkownikami Steama, ale najważniejsze, że wszyscy przechodzą w swoim tempie – i dobrze się bawią. Taki  był w końcu cel FromSoftware. Stworzyć „ ” dla każdego . Czy się udało? Cóż, jeśli Margita i Godricka pokonuje średnio 7-8 na 10 graczy, to chyba można stwierdzić, że tak. Tu nikt nie odpada w przedbiegach niczym w starciach z Ojcem Gascoigne’em w czy Genichiro Ashiną w . Zresztą zobaczcie sami. Boss  Gracze na Steamie, którzy go/ją pokonali (7/14 marca / 11 kwietnia)  Gracze w PSN, którzy go/ją pokonali (7/14 marca / 11 kwietnia)  Margit, Upadły Omen  66,2% / 70,3% / 74,4%  wzrost o 4,1 / 4,1 pp.  76,45% / 80,78% / 85,24%  wzrost o 4,33 / 4,46 pp.  Godrick, Zszywaniec  55,9% / 60,8% / 67,5%  wzrost o 4,9 / 6,7 pp.  62,17% / 71,19% / 79,18%  wzrost o 9,02 / 7,99 pp.  Lwi wynaturzeniec  47,1% / 53,7% / 60,8%  wzrost o 6,6 / 7,1 pp.  58,24% / 67,85% / 76,79%  wzrost o 9,61 / 8,94 pp.  Rudy Wilk Radagona  38,4% / 53,7% / 59,5%  wzrost o 15,3 / 5,8 pp.  42,24% / 56,64% / 71,32%  wzrost o 14,4 / 14,68 pp.  Rennala, Królowa Pełni Księżyca  35,3% / 45,7% / 57,5%  wzrost o 10,4 / 11,8 pp.  38,74% / 54,04% / 69,64%  wzrost o 15,3 / 15,6 pp.  Loretta, królewski rycerz  32,9% / 43,6% / 55,9%  wzrost o 10,7 12,3 pp.  36,19% / 52,20% / 68,57%  wzrost o 16,01 16,37 pp.  Magmowy żmij Makar  25,4% / 34,7%/ 47%  wzrost o 9,3 / 12,3 pp.  30,14% / 45,50% / 63,78%  wzrost o 15,36 / 18,28 pp.  Radahn, Gwiezdna Plaga  23,5% / 35,2% / 51,1%  wzrost o 11,7 / 15,9 pp.  24,57% / 42,01% / 63,68%  wzrost o 17,44 / 21,67 pp.  Duch przodka  23,3% / 30,2%/ 40%  wzrost o 6,9 / 9,8 pp.  32,31% / 45,61%/ 61,96%  wzrost o 13,30 / 16,35 pp.  Łza naśladowcy  20% / 31,5% / 47,5%  wzrost o 11,5 / 16 pp.  20,85% / 38,23% / 60,59  wzrost o 17,38 / 22,36 pp.  Żołnierz drakonidów z Nokstelli  18,3% / 25,8% / 37%  wzrost o 7,5 / 11,2 pp.  25,23% / 39,78% / 59,27%  wzrost o 14,55 / 19,49 pp.  Godfrey, Pierwszy Władca  15,9% / 27,3% / 44,3%  wzrost o 11,4 / 17 pp.  15,64% / 31,79% / 56,08%  wzrost o 16,15 / 24,29 pp.  Morgott, Król Omenu  15% / 26,3% / 43,5%  wzrost o 11,3 / 17,2 pp.  14,68% / 30,63% / 55,26%  wzrost o 15,95 / 24,63 pp.  Astel, Zrodzony z Pustki  13,3% / 23,4% / 38,9%  wzrost o 10,1 / 15,5 pp.  14,83% / 31,08% / 54,04%  wzrost o 16,25 / 22,96 pp.  Duch królewskiego przodka  11,9% / 19,8% / 32,7%  wzrost o 7,9 / 12,9 pp.  15,75% / 31,89% / 54,49%  wzrost o 16,14 / 22,6 pp.  Nieustraszone gargulce  11,3% / 20,1% / 34,2%  wzrost o 8,8 / 14,1 pp.  14,35% / 30,25% / 53,61%  wzrost o 15,9 / 23,36 pp.  Elemer od Głogu  10,2% / 19% / 34,1%  wzrost o 8,8 / 15,1 pp.  13,23% / 29,13% / 53,09%  wzrost o 15,9 / 23,96 pp.  Rykard, Pan Bluźnierstwa  9,8% / 19,3% / 35,8%  wzrost o 9,5 / 16,5 pp.  11,39% / 26,79% / 51,75%  wzrost o 15,40 / 24,96 pp.  Szlachcic boskiej skóry  9,5% / 19,0% / 34,7%  wzrost o 9,5 / 15,7 pp.  11,64% / 27,44% / 52,4%  wzrost o 15,8 / 24,96 pp.  Dowódca Niall  8,9% / 18,6% / 35,4%  wzrost o 9,7 / 16,8 pp.  9,63% / 24,17% / 49,56%  wzrost o 14,54 / 25,39 pp.  Ognisty olbrzym  8,5% / 18,1% / 35,2%  wzrost o 9,6 / 17,1 pp.  8,98% / 22,94% / 48,75%  wzrost o 13,96 / 25,81 pp.  Duet boskiej skóry (Apostoł boskiej skóry i Szlachcic boskiej skóry)  6,6% / 15,3% / 32,4%  wzrost o 8,7 / 17,1 pp.  6,98% / 19,85% / 52,40%  wzrost o 12,87 / 32,55 pp.  Loretta, rycerz Świętego Drzewa  6,1% / 14,2% / 29,9%  wzrost o 8,1 / 15,7 pp.  7,41% / 20,55% / 45,7%  wzrost o 13,14 / 25,15 pp.  Maliketh, Czarna Klinga  5,7% / 13,8% / 30.3%  wzrost o 8,1 / 16,5 pp.  6,30% / 18,61% / 44,39%  wzrost o 12,31 / 25,78 pp.  Mohg, Pan Krwi  5,7% / 15,1% / 30%  wzrost o 9,4 / 14,9% pp.  6,64% / 22,60% / 47,03  wzrost o 15,96 / 24,43 pp.  Mohg, Omen  5,4% / 12,4% / 26,1%  wzrost o 7 / 13,7 pp.  8,65% / 22,47% / 44,56%  wzrost o 13,82 / 22,09 pp.  Wojownik Hoarah Loux  5,1% / 12,9% / 29%  wzrost o 7,8 / 16,1 pp.  5,78% / 17,53% / 43,16%  wzrost o 11,75 / 25,63 pp.  Drakolicz Fortissax  4,8% / 10,7% / 22,2%  wzrost o 5,9 / 11,5 pp.  8,81% / 22,34% / 45,19%  wzrost o 13,53 / 22,85 pp.  Malenia, Ostrze Miquelli  4,5% / 11,6% / 26,3%  wzrost o 7,1 / 14,7 pp.  5,75% / 17,70% / 42,68%  wzrost o 11,95 / 24,98 pp. ", "url": "https://www.gry-online.pl/newsroom/elden-ring-co-trzeci-gracz-playstation-z-platyna-soulsy-dla-kazde/zb21a3d"}
{"title": "Ujawnił na streamie, że oszukuje - jeden z najlepszych graczy CoD: Vanguard zaliczył wpadkę", "date": "11 kwietnia 2022, 13:46", "summary": "Jeden z czołowych graczy CoD: Vanguard okazał się oszustem. Sprawa wyciekła przez błąd podczas transmisji na Twitchu.", "text": "O tym, że gry z serii Call of Duty mają problemy z cheaterami, wie chyba każdy. Po sieci krąży masa informacji na temat fal banów, błędach systemu RICOCHET oraz rozgrywkach psutych przez oszustów. Niestety wygląda na to, że tyczy się to nie tylko szerzej nieznanych trolli, których ulubionym zajęciem jest uprzykrzanie życia innym. W proceder ten zaangażowani są także czołowi gracze, cieszący się dużą popularnością w społeczności fanów . W ostatnim czasie świadkami oszustwa stali się widzowie streamera o nicku PLEHXIFY. Zyskał on popularność m.in. dzięki transmitowaniu meczów w Call of Duty: Vanguard . W tytule tym mógł pochwalić się pozycją drugiego najlepszego gracza w rozgrywkach rankingowych. Najwyraźniej nie było to jednak związane z jego umiejętnościami. Podczas ostatniego z prowadzonych przez niego streamów transmisja na chwilę się zacięła. To zaś doprowadziło do ujawnienia, że PLEHXIFY używa wall hacka. Wyjaśniałoby to jego nadludzką szybkość reakcji i zdolność przewidywania ruchów wroga. Oczywiście streamer tłumaczył się, że możliwość obserwowania przeciwników przez ściany była związana z problemami technicznymi. Gdy gracze nie przyjęli takiego wytłumaczenia, PLEHXIFY zmienił taktykę. Według niego otrzymał on dostęp do cheatów w zamian za skórkę Diamond Camo. Najwyraźniej z ciekawości je uruchomił, a następnie rzekomo nie wiedział, jak się ich pozbyć. Co zrozumiałe, wytłumaczenie to nie przekonało zirytowanych graczy. Z Twitcha zniknęło zaś konto streamera. Trudno powiedzieć, czy usunął je sam, czy może zajęła się tym administracja serwisu.", "url": "https://www.gry-online.pl/newsroom/ujawnil-na-streamie-ze-oszukuje-jeden-z-najlepszych-graczy-cod-va/zc21a35"}
{"title": "Drużyna Jankosa wraca na tron LoL-a, G2 wygrywa mistrzostwa Europy LEC", "date": "11 kwietnia 2022, 15:32", "summary": "Drużyna G2 Esports z Marcinem „Jankosem” Jankowskim w składzie wczoraj dopięła swego i sięgnęła po mistrzostwo Europy League of Legends. Drużyna polskiego dżunglera w finale ograła zespół Rouge 3:0.", "text": "Niedzielny wieczór obfitował w e-sportowe emocje dla polskich fanów. Oprócz finału ESL Pro League w wczoraj odbył się finał sezonu League of Legends European Championship (LEC). W finale zespół Marcina „Jankosa” Jankowskiego – G2, w pewnym stylu pokonał przeciwników z drużyny Rouge wynikiem 3:0. Tym samym „samuraje”, jak potocznie mówi się o G2 Esports, powrócili na szczyt na Starym Kontynencie po półtora roku. Zwycięstwo w LEC jest o tyle istotne, że stanowi ono swoisty powrót Jankosa na tron po nieudanym ubiegłym sezonie, którego konsekwencją była znacząca przebudowa składu G2. Z ekipy odeszło wówczas trzech graczy, choć Polak pozostał. Jak się okazało, to była dobra decyzja. Podczas pomeczowego wywiadu Marcin Jankowski nie krył radości ze zwycięstwa: Zwycięstwo w LEC daje G2 Esports przepustkę do walki o kolejne trofeum – Mid-Season Invitational 2022, w którym rywalizować będą mistrzowie poszczególnych lig Turniej odbędzie się w maju w południowokoreańskim mieście Busan.", "url": "https://www.gry-online.pl/newsroom/druzyna-jankosa-wraca-na-tron-lol-a-g2-wygrywa-mistrzostwa-europy/zd21a3f"}
{"title": "10 najlepszych telefonów dla dziecka. Ranking 2022", "date": "11 kwietnia 2022, 14:15", "summary": "Dobór telefonu dla pociechy nie zawsze jest prostym zadaniem. Należy uwzględnić nie tylko wiek dziecka, ale także jego potrzeby. Ponadto rodzice mają różne podejście do tego, jak powinien wyglądać sprzęt dla kilkulatka i nastolatka.", "text": "Tworząc nasze zestawienie, staraliśmy się, żeby urządzenia były w miarę możliwości jak najbardziej różnorodne. Dlatego też oprócz smartfonów znalazły się w nim również uwspółcześnione wersje tradycyjnych telefonów komórkowych z fizyczną klawiaturą. W przypadku modeli smart i tych „zwykłych” uwzględniliśmy urządzenia z różnych półek cenowych. Zrezygnowaliśmy jednak z flagowców. Dziecko i telefon za kilka tysięcy złotych to raczej nie najlepszy pomysł , choć z drugiej strony, kto bogatemu zabroni? Z obsługą największych smartfonów za pomocą tylko jednej dłoni problem mają dorośli, a co dopiero dzieci. W przypadku kilkulatków niewygodne może być korzystanie z wielkich modeli nawet przy użyciu dwóch rąk. Dlatego też dla młodszych dzieci warto wybrać coś, czego będą mogły używać w miarę komfortowo. W parze z niewielkimi rozmiarami powinna iść niewielka masa. Najmniejsze i najlżejsze są zwykłe komórki. Na liście zawarliśmy też dwa kompaktowe smartfony. Wybór telefonu na podstawie tylko i wyłącznie jego wymiarów i wagi nie zawsze jest dobrym kierunkiem. Najlżejsze urządzenia najczęściej dysponują niewielkim akumulatorem oraz nie są odporne na uszkodzenia . To drugie nie powinno być jednak wielkim problemem, gdy dziecko będzie szanować sprzęt i np. zostanie oduczone biegania z telefonem w ręku. Tylko część budżetowych smartfonów ma wbudowane opcje ochrony wzroku. Mowa tu głównie o filtrze niebieskiego światła. Jego brak przy dłuższym użytkowaniu urządzenia może wywołać ból głowy oraz problemy z zasypianiem. Mimo wszystko nie warto zaprzątać sobie głowy tym, czy dany model oferuje ochronne funkcje, czy też nie. Jeśli po zakupie okaże się, że ich nie ma, wystarczy pobrać darmową aplikację, która je doda. Alternatywą jest zakup foli blokującej niebieskie światło. Jej koszt to około 20 złotych. Najważniejszą rzeczą dla każdego odpowiedzialnego rodzica powinno być odcięcie swojego dziecka od treści nieprzystających do jego wieku. Dlatego też świetną informacją jest to, że kontrola rodzicielska w podstawowej formie znajduje na praktycznie każdym współczesnym smartfonie. Zamiast skupiania się na ustawieniach w systemie Android i Sklepie Play najlepiej będzie jednak od razu pobrać i zainstalować darmowe narzędzie  Family Link . Oprócz blokowania dostępu do nieodpowiednich aplikacji i zasobów internetu pozwala ono m.in. sprawdzić, gdzie znajduje się pociecha i wytyczyć konkretne godziny korzystania z telefonu. Google Asystent usprawnia korzystanie z telefonu. Szczególnie gdy dziecko nie potrafi jeszcze pisać. Sytuacje z życia wzięte pokazują jednak, że kilkulatek może za jego pośrednictwem zapuścić się w rejony internetu, które nie są dla niego odpowiednie . Przykład? Po wypowiedzeniu frazy „filmy dla dorosłych” w wynikach wyszukiwania niekoniecznie pojawi się Rambo i Terminator (ich też dziecko nie powinno oglądać). Nie oznacza to, że od razu trzeba dezaktywować Asystenta. Lepszym pomysłem wydaje się ustawienie opcji w Kontroli Rodzicielskiej, które zablokują wyświetlanie pewnych treści. Przejdźmy jednak do konkretnych modeli. Zebraliśmy dla Was zarówno niedrogie, ale solidne smartfony, jak i konstrukcje małe, dla niewielkich dłoni, sprzęt pancerny dla nadrzewnych wspinaczy i proste telefony, które pozwolą maluchowi pozostać w kontakcie z rodzicami. Mamy nadzieję, że znajdziecie wśród tych propozycji coś dopasowanego do Waszych potrzeb.", "url": "https://www.gry-online.pl/S018.asp?ID=3474"}
{"title": "Kingdom Hearts 4 - zapowiedziano nową grę z disnejowskiej serii RPG [Aktualizacja]", "date": "11 kwietnia 2022, 09:25", "summary": "Firma Square Enix zapowiedziała Kingdom Hearts 4 oraz Kingdom Hearts Missing-Link, czyli dwie nowe odsłony popularnej marki RPG.", "text": "Wczoraj seria Kingdom Hearts obchodziła 20. urodziny. Firma Square Enix postanowiła uczcić to wydarzenie, zapowiadając szereg nowych projektów, w tym oraz mobilne . Oficjalna strona marki Zacznijmy od , bo była to najważniejsza zapowiedź wczorajszego wieczora. Produkcja zapoczątkuje nową, wielką linię fabularną zatytułowaną . Przygoda rozpocznie się w przypominającym współczesne japońskie metropolie mieście Quadratum – znacznie większym niż jakakolwiek lokacja z wcześniejszych odsłon serii. Miejsce to będzie celem ataku mrocznych istot. W grze powrócą znani bohaterowie, w tym Sora, Kaczor Donald czy Goofy. Nie zabraknie także nowych postaci, w tym tajemniczej dziewczyny o imieniu Strelitzia. Niestety, autorzy nie są gotowi podać daty premiery. Potwierdzili jedynie, że gra znajduje się na wczesnym etapie produkcji, dlatego sporo poczekamy na jej rynkowy debiut. Spodziewamy się, że gra nie wyjdzie wcześniej niż w 2024/2025 roku. Nie zdradzono również platform sprzętowych. Sądząc jednak po historii wydania Kingdom Hearts 3 , oczekujemy, że produkcja najprawdopodobniej trafi na PlayStation 5, Xboksa Series X/S oraz PC. Zaprezentowany fragment gameplaya wygląda imponująco, co w połączeniu z odległą premierą sprawia, że na pewno będzie to produkcja na next-genowe konsole. Dodatkowo w ostatnich latach Square Enix wydaje praktycznie wszystkie swoje produkcje także na PC i nie ma powodu przypuszczać, aby w przypadku miało być inaczej. Większość zwiastuna pokazuje miasto Quadratum, ale pojawia się również krótki fragment w lesie. Fani spekulują , że jest to planeta Endor z , gdyż przez chwilę na ekranie widać obiekt, wyglądający jak część maszyny bojowej AT-ST Walker. to nowa mobilna odsłona cyklu. Gra zmierza na urządzenia z systemami iOS i Android. Ten projekt jest na bardziej zaawansowanym etapie produkcji niż . Nie podano co prawda daty premiery, ale ogłoszono, że beta-testy ruszą w tym roku. O grze wiadomo niewiele. Twórcy ogłosili jedynie, że w będziemy podróżowali między magiczną krainą Scala Ad Caelum a światem rzeczywistym. Fanów marki zainteresować powinna również informacja, że ostatni rozdział historii w mobilnej grze Kingdom Hearts Dark Road zadebiutuje w sierpniu tego roku jako darmowa aktualizacja.", "url": "https://www.gry-online.pl/newsroom/kingdom-hearts-4-zapowiedziano-nowa-gre-z-disnejowskiej-serii-rpg/z921a23"}
{"title": "Dodatek do Cyberpunk 2077 - prace trwają; Paweł Sasko o postaciach, których zabrakło", "date": "11 kwietnia 2022, 10:10", "summary": "Paweł Sasko udzielił odpowiedzi na pytanie, czy dodatek fabularny do gry Cyberpunk 2077 ukaże się jeszcze w tym roku. Podał także powód, dlaczego niektóre postacie z papierowego Cyberpunka 2020 nie pojawiły się w ostatnim dziele studia.", "text": "W swojej niedawnej transmisji z gry Cyberpunk 2077 Paweł Sasko – projektant zadań w tej produkcji – zdradził kilka szczegółów o procesie powstawania jej fabuły, a także uchylił rąbka tajemnicy odnośnie do nadchodzących rozszerzeń fabularnych. Zapytany przez jednego z użytkowników , czy rozszerzeń możemy spodziewać się jeszcze w tym roku , projektant odpowiedział ( 02:55:40 ): Sasko podziękował również fanom za okazane wsparcie i opinie na temat prac nad grą. Projektant podzielił się również ciekawostką prosto zza kulis powstawania ( 02:54:20 ). Wyjaśniałoby to, dlaczego w świecie zabrakło takich znanych postaci z , jak Spider Murphy czy Morgan Blackhand . Niewykluczone, że zobaczymy je we wspomnianym rozszerzeniu. Twitch KamilCesaro Recenzja gry Cyberpunk 2077 – samuraju, masz świetne RPG do ogrania Cyberpunk 2077 – poradnik do gry Cyberpunk 2077 – strona oficjalna", "url": "https://www.gry-online.pl/newsroom/dodatek-do-cyberpunk-2077-prace-trwaja-pawel-sasko-o-postaciach-k/za21a24"}
{"title": "Absurdy Wiedźmina wyśmiane przez znanych youtuberów", "date": "11 kwietnia 2022, 10:32", "summary": "Wiedźmin obiektem dowcipów. Specjalizujący się w parodiowaniu youtuberzy z grupy Viva La Dirt League przedstawili zwiastun nowej serii.", "text": "Mało Wam przygód Geralta w serialu od Netflixa? A może nie jesteście zadowoleni z ostatniego sezonu i zastanawiacie się nad tym, co twórcy mogli zrobić lepiej? Już niebawem poznacie nowe perypetie Geralta i Jaskra , lecz tym razem nie zostaną one przedstawione przez Netflixa, a przez Viva La Dirt League , czyli grupę youtuberów tworzących parodie inspirowane grami komputerowymi. Seria będzie nosić nazwę a jej pierwszy odcinek zadebiutuje 15 kwietnia. Na oficjalnym kanale Viva La Dirt League w serwisie YouTube pojawił się zwiastun parodii , która w przyszłości zostanie udostępniona przez twórców w formie epizodycznej. Na filmie widać na przykład sytuację, kiedy Geralt musi ze wszystkich sił wytężać swe wiedźmińskie zmysły, aby zauważyć zwłoki leżące u jego stóp. Na plus należy zaliczyć scenografię, udźwiękowienie i montaż, które stoją na naprawdę wysokim poziomie. Youtuberzy nie muszą przy tym ograniczać się wyłącznie do żartów nawiązujących do serialu , więc niewykluczone, że wyśmieją także Geralta przedstawionego w grze Wiedźmin 3: Dziki Gon . Kto wie, może w parodii białowłosy zabójca potworów skusi się na partyjkę Gwinta? Viva La Dirt League to grupa nowozelandzkich youtuberów, którzy specjalizują się w tworzeniu krótkich skeczów wyśmiewających gry komputerowe . Zespół założyli Rowan Bettjeman, Alan Morrison i Adam King, lecz czasami w krótkich filmach pojawiają się także inni członkowie, tacy jak Hamish Parkinson, Britt Scott Clark, Ben Van Lier i Ellie Harwood. Komicy zyskali rozgłos dzięki parodiom takich gier, jak , czy cyklu . Seria, która w dowcipny sposób oceni , również ma wielką szansę na to, by okazać się sukcesem. Oficjalny kanał VLDL w serwisie Youtube Zwiastun parodii Wiedźmina", "url": "https://www.gry-online.pl/newsroom/absurdy-wiedzmina-wysmiane-przez-youtuberow-z-viva-la-dirt-league/zb21a25"}
{"title": "Reanimacja eFootball 2022; Konami poważnie traktuje krytykę graczy", "date": "11 kwietnia 2022, 11:01", "summary": "Gra eFootball 2022 otrzyma w tym tygodniu aktualizację 1.0.0, która ma naprawić większość problemów zgłaszanych przez graczy. Konami zapewnia, że traktuje krytykę społeczności bardzo poważnie.", "text": "Minęło ponad pół roku od premiery eFootball 2022 , czyli nowego, darmowego wydania PES-a . Niestety „kopanka” od Konami może pochwalić się jedynie przytłaczająco negatywnymi recenzjami na Steamie i tytułem najgorzej ocenianej gry 2021 roku przez użytkowników serwisu Metacritic.com . Istnieje jednak szansa, że w tym tygodniu coś się zmieni na lepsze. 14 kwietnia ukaże się patch 1.0.0 , który ma naprawić większość problemów zgłaszanych przez społeczność w ostatnich miesiącach. Co konkretnie? W sumie wszystko – od grafiki po gameplay. Jak przekonywali niedawno twórcy, tak im zależało na szybkim wydaniu gry, że zapomnieli o jakości. Po tym dość ogólnym – ale jakże trafnym stwierdzeniu – serwis VGC poprosił przedstawicieli Konami o szerszy komentarz. Według rzecznika firmy: Jak to się skończyło – już wiemy. Pytanie, co będzie dalej. Konami zapewnia bowiem, że bardzo poważnie podchodzi do krytyki graczy i „nadało priorytet ulepszeniom oraz poprawkom adekwatnym do ich opinii”. Co z tego wyniknie, przekonamy się już w czwartek – w końcu jest dostępny za darmo. Na razie to jedna z jego nielicznych zalet, choć jak donosi serwis VGC, którego redaktor miał już okazję grać w wersję 1.0.0, wkrótce ma być ich więcej. Oprócz tego, że sprawuje się ona całkiem nieźle – choć do ideału ponoć wciąż sporo brakuje – szczególnie chwalony jest przerobiony system defensywy (przypominający ten z ostatnich odsłon ) oraz funkcja zwana zachwycającym kopnięciem (ang. stunning kick). Pozwala ona wyprowadzać efektowne podania i strzały zamiast tych normalnych. Używając jej, trzeba jednak brać poprawkę na to, że animacja ruchu jest znacznie dłuższa, a co za tym idzie – można łatwiej stracić piłkę.", "url": "https://www.gry-online.pl/newsroom/reanimacja-efootball-2022-konami-powaznie-traktuje-krytyke-graczy/zc21a26"}
{"title": "Elon Musk jednak się rozmyślił - nie będzie zarządzał Twitterem", "date": "11 kwietnia 2022, 12:10", "summary": "Elon Musk nie będzie członkiem zarządu Twittera. Poinformował o tym CEO spółki, Parag Agrawal.", "text": "Elon Musk nie będzie członkiem zarządu Twittera . Po tym, jak miliarder kupił 9,2% akcji spółki, stał się jej największym udziałowcem. Rankiem 9 kwietnia poinformował jednak, że rezygnuje z możliwości bycia członkiem rady nadzorczej. Informację przekazał CEO Twittera, Parag Agrawal. Parag Agrawal informował niedawno, że Elon Musk będzie nie tylko największym udziałowcem Twittera, ale również członkiem zarządu spółki. Oficjalnie miliarder miał wejść w struktury rady nadzorczej 9 kwietnia, jednak rankiem tego samego dnia poinformował , że rezygnuje z tej możliwości . Dyrektor generalny serwisu wystosował komunikat do swojej firmy, w którym poinformował o decyzji Muska i jednocześnie zaznaczył, że spółka zawsze ceniła udziałowców – niezależnie od tego, czy są w zarządzie, czy nie. Parag Agrawal napisał też, że Twitter zawsze będzie otwarty na to, co może mu dać szef SpaceX i Tesli. Bycie w strukturach zarządu Twittera z pewnością pozwoliłoby Muskowi w bardziej stanowczy sposób decydować o tym, jak będzie rozwijał się serwis. Problem polega na tym, że osoby wchodzące w skład rady nadzorczej nie mogą posiadać udziałów większych niż 14,9%. Niewykluczone zatem, że miliarder zrezygnował z tej posady, aby w przyszłości móc wykupić liczbę akcji wykraczającą poza ten wynik. Elon niewątpliwie lubi Twittera, więc nie byłoby niespodzianką, gdyby planował zwiększyć swoje udziały. Wiadomość CEO Twittera Profil na Twitterze Elona Muska", "url": "https://www.gry-online.pl/hardware/elon-musk-jednak-sie-rozmyslil-nie-bedzie-zarzadzal-twitterem/z821a2b"}
{"title": "LEGO Skywalker Saga zrzuciło Elden Ring z tronu Steam", "date": "11 kwietnia 2022, 11:23", "summary": "Dobiegła końca wielotygodniowa dominacja Elden Ring w rankingach sprzedaży Steam. Nowym liderem została gra LEGO Skywalker Saga.", "text": "Jak w każdy poniedziałek udostępniono listę największych (według przychodów) bestsellerów poprzedniego tygodnia na Steamie. Liderem sprzedaży była gra LEGO Star Wars: The Skywalker Saga , której różne edycje zajęły aż cztery miejsca w top 10, w tym to najważniejsze, czyli pierwsze. Tym samym dobiegła końca sześciotygodniowa dominacja Elden Ring , które musiało zadowolić się pozycją numer trzy (drugie miejsce przypadło Steam Deckowi). Najnowsza odsłona serii studia Traveller’s Tales uzyskała najlepsze wyniki aktywności w historii produkcji korzystających z marki Gwiezdnych wojen. nie tylko sprzedaje się wyśmienicie, ale cieszy się także dużym uznaniem wśród graczy – na Steamie 94% recenzji użytkowników to pochwała tego tytuły, co serwis kategoryzuje jako „bardzo pozytywny” odbiór gry. Recenzja gry LEGO Skywalker Saga – beztroska rozrywka na trudne czasy LEGO Skywalker Saga – poradnik do gry Warto także zwrócić uwagę na wciąż wysoką sprzedaż Dread Hunger . W ubiegłym tygodniu grze po raz kolejny udało się ustanowić nowy rekord aktywności – w najgorętszym momencie minionej środy na Steamie bawiły się w niej 107 982 osoby równocześnie. Ponadto dzięki atrakcyjnym przecenom do top 10 powróciły gry Sea of Thieves oraz Horizon: Zero Dawn – Complete Edition . #  Gra:  1.  LEGO Star Wars: The Skywalker Saga  2.  Steam Deck  3.  Elden Ring  4.  LEGO Star Wars: The Skywalker Saga  5.  LEGO Star Wars: The Skywalker Saga  6.  LEGO Star Wars: The Skywalker Saga  7.  Zestaw VR Valve Index  8.  Sea of Thieves  9.  Dread Hunger  10.  Horizon: Zero Dawn – Complete Edition ", "url": "https://www.gry-online.pl/newsroom/lego-skywalker-saga-zrzucilo-elden-ring-z-tronu-steam/zd21a27"}
{"title": "Sketches of Glory", "date": "None", "summary": "Komiks: Tryby wojny z serii Sketches of Glory, odc. 32, autor: Filip Sulkovsky", "text": "", "url": "https://www.gry-online.pl/komiksy/sketches-of-glory/sketches-of-glory-odc-32-tryby-wojny/z921a2c"}
{"title": "Mapa LoL-a utrudnia grę; Riot chciał szczegółowości, a zepsuł mechanikę", "date": "11 kwietnia 2022, 11:48", "summary": "League of Legends ma swoje uroki. Jednym z nich są umiejętności, które czasami nie działają tak, jak powinny ze względu na... ukształtowanie terenu? Gracze próbują dociec prawdy.", "text": "Wszyscy dobrze wiemy, jak denerwujące w grach mogą być hitboxy czy też blokujące postać tekstury. Najczęściej jest to kwestia tego, że twórcy chcą dopracować swoją grę, a efekt jest jaki jest. Podobna sytuacja ma miejsce w League of Legends , gdzie jeden z graczy zwrócił uwagę na dziwną zależność, która utrudnia wykorzystanie niektórych umiejętności. Dyskusję na temat tego jakże ciekawego zjawiska w „Lidze” rozpoczął użytkownik bobbybobsen , który w minutowym filmie przedstawił to, jaka jest różnica w wysokości terenu wokół rzeki . Dobór czempiona jest przypadkowy, pownieważ Gangplank, choć do najpopularniejszych nie należy, posiada mechanikę, której górzysty teren raczej nie sprzyja. Jak możemy zobaczyć na filmie, w zależności od tego, gdzie gracz ustawi beczki, mogą one zostać połączone lub nie (teoretycznie znaczenie w tym kontekście powinna mieć jedynie odległość dzieląca beczki). Ma to spory wpływ na rozgrywkę, ponieważ Gangplank dzięki łączeniu ładunków może wywołać reakcję łańcuchową, co jednoznaczne jest z zadaniem większych obrażeń. Dziwnego zachowania beczek można doświadczyć również w innym miejscu, jak mówi Rift-Duck . Różnice w wysokości na mapie nie uderzają jednak tyko w bohatera z Bilgewater, ale równiez w Ahri , Vel’Koza, Jhina i wielu innych. Ponownie mamy do czynienia z dość kontrowersyjnym zachowaniem umiejętności, a w zasadzie nawet brakiem jakiegokolwiek zachowania. Trzeba zaznaczyć, że wszystkie z podanych przez graczy przykładów występują w okolicach środkowej alei. Jak wygląda sytuacja w dolnej czy górnej alei? O tym chyba trzeba przekonać się samemu. To pytanie nurtuje chyba wszystkich graczy, którzy udzielają się pod wspomnianym wyżej postem. na dobrą sprawę nie ma żadnej mechaniki związanej z wysokością terenu czy też ścian, a częściej zwraca się uwagę na grubość struktur. Wobec tego zaczęły się pojawiać komentarze, porównujące do konkurencji – Doty 2 , gdzie różnice w wysokości faktycznie mają wpływ na grę: Kolejny z użytkowników jako przyczynę dziwnego zachowania umiejętności wskazuje ustawienie kamery w grze . Według jego analizy to, jak gracz widzi zasięg umiejętności, w rzeczywistości jest nieco inne, niż sugerowałyby to wskaźniki. Za tą teorią opowiada się również inny użytkownik – rimidalv25 , który anomalię dotyczącą umiejętności Gangplanka również wyjaśnił pozycją kamery , a niekoniecznie wysokością. Jak jednak w rzeczywistości wygląda sytuacja na Summoner’s Riift – czy jest to wina pagórków, czy też kamery – to wie tylko Riot Games.", "url": "https://www.gry-online.pl/newsroom/mapa-lol-a-utrudnia-gre-riot-chcial-szczegolowosci-a-zepsul-mecha/ze21a28"}
{"title": "Latający plecak trafił do testów - dron, który uniesie człowieka", "date": "11 kwietnia 2022, 12:25", "summary": "Czy można sobie wyobrazić, jakie wrażenia zapewni nieduże urządzenie założone na plecy, które pozwoli człowiekowi latać? Dzieło firmy Ascend Dynamics może pomóc nam tego doświadczyć.", "text": "Człowiek od zawsze marzył o lataniu. To pragnienie było motorem postępu technologicznego i źródłem wielu wynalazków. W dzisiejszych czasach można je uznać za praktycznie zrealizowane . Są jednak osoby, którym samolot czy śmigłowiec nie wystarczają – pragną one większej wolności i chcą latać niczym ptaki. Takie firmy, jak Gravity i Ascend Dynamics , pracują nad urządzeniami, które pomogłyby to marzenie zrealizować. Mowa tutaj o tzw. jetpackach, czyli plecakach lotniczych . Odrzutowe dzieło tej pierwszej firmy powstało raczej z myślą o wojskowych czy ratownikach i wymaga specjalistycznego przeszkolenia. Ascend Dynamics przedstawia zaś nieco inne podejście do tematu „osobistego latania”. Jej flagowy produkt – SkyPak – to w pewnym uproszczeniu elektryczny dron zakładany na plecy . Podobnie jak popularne na rynku konsumenckim urządzenia posiada napęd śmigłowy. Urządzenie waży 36 kg, a łączna moc wszystkich dwunastu silników to 84 kW . Podczas przeprowadzonych testów wystarczyło to do uniesienia 45-kilogramowej ramy wraz z manekinem. Wersja finalna ma mieć możliwości nośne na poziomie 90 kilogramów i być równie łatwa w obsłudze jak popularne drony. Problemem jest jednak zasilanie – zainstalowane akumulatory wystarczają zaledwie na 2 minuty lotu . Daniel Gant, założyciel Ascend Dynamics, twierdzi, że SkyPak będzie wymagał znacznego postępu w magazynowaniu energii elektrycznej. Jeśli to nie nastąpi w najbliższym czasie, Gant rozważa nawet montaż generatora spalinowego w urządzeniu. Niestety, tak duża swoboda latania raczej nie będzie tania. Daniel Gant mówi o kosztach zakupu gotowego urządzenia pomiędzy 120 tys. a 180 tys. dolarów (nawet 766 tys. złotych). Czy taki sposób amatorskiego latania może rywalizować z paralotniarstwem?", "url": "https://www.gry-online.pl/hardware/dron-ktory-uniesie-czlowieka-czyli-latajacy-plecak-trafil-do-test/z721a2a"}
{"title": "Wyciekła data prezentacji teasera CoD MW2 (plotka)", "date": "11 kwietnia 2022, 12:20", "summary": "RalphsValve poinformował, że teaser Call of Duty: Modern Warfare 2 może zadebiutować jeszcze przed końcem kwietnia. Na pełny zwiastun mamy poczekać nieco dłużej.", "text": "RalphsValve to informator specjalizujący się w przeciekach dotyczących nadchodzącej odsłony o podtytule Modern Warfare 2 . Na Twitterze zamieścił on wczoraj – 50 minut po północy – grafikę, na której widnieje odliczanie: Oznacza to zapewne, że pierwsza oficjalna zajawka – najpewniej krótki teaser – nowego  może zadebiutować 30 kwietnia . Choć Ralph jest stosunkowo nowym informatorem, jego doniesienia pokrywają się z tymi Toma Hendersona, którego przecieki w przeszłości okazywały się nierzadko prawdą. To także on informował o na długo, zanim ten tytuł został oficjalnie zapowiedziany. Mimo wszystko warto traktować je z przymrużeniem oka, a nuż się miło zaskoczymy. Call of Duty – strona oficjalna", "url": "https://www.gry-online.pl/newsroom/call-of-duty-modern-warfare-2-wyciekla-data-teasera-plotka/zf21a29"}
{"title": "The Batman na HBO Max - jest data premiery", "date": "11 kwietnia 2022, 12:25", "summary": "Polski oddział HBO Max ujawnił, kiedy The Batman pojawi się na platformie. Hitową produkcję z Robertem Pattinsonem obejrzymy tuż po świętach wielkanocnych.", "text": "Doskonałe przyjęcie The Batman przez krytyków i widzów z pewnością zachęciło wielu z nas, by zobaczyć film w kinach. Mamy jednak dobrą wiadomość dla niezdecydowanych, którzy filmu nie widzieli oraz tych, którzy chętnie obejrzą go ponownie. pojawi się na HBO Max 18 kwietnia , rozszerzając już teraz imponującą ofertę platformy streamingowej. Informacja pojawiła się na profilach serwisu w mediach społecznościowych. Nowy Batman w wykonaniu Roberta Pattinsona spotkał się z wieloma pochwałami. W serwisie Rotten Tomatoes film osiągnął wynik 85% świeżości na podstawie ocen krytyków i 87% na podstawie opinii widzów. Według wielu produkcja Matta Reevesa może rywalizować nawet z uwielbianą trylogią Christophera Nolana. Warto dodać, że film osiągnął również sukces komercyjny. Jego debiut był najlepszą premierą kinową studia Warner Bros. od czasu Jokera , co jest tym bardziej imponujące z uwagi na post-pandemiczne realia. może pochwalić się także imponującą obsadą. Oprócz Roberta Pattinsona w filmie występują m.in. Colin Farrell (Pingwin), Zoë Kravitz (Kobieta-Kot), Andy Serkis (Alfred) oraz Jeffrey Wright (James Gordon). HBO Max kupisz tutaj", "url": "https://www.gry-online.pl/newsroom/the-batman-na-hbo-max-jest-data-premiery/za21a2d"}
{"title": "Polacy rzucili się kupować Motorsport Manager - top 10 w Polsce", "date": "11 kwietnia 2022, 12:59", "summary": "W ubiegłym tygodniu w Polsce najlepiej sprzedawały się sprawdzone hity, takie jak The Sims 4, FIFA 22 czy Elden Ring. Wśród bestsellerów pojawiło się jednak kilka niespodzianek, w tym Motorsport Manager.", "text": "Przygotowaliśmy dla Was kolejne zestawienie najczęściej kupowanych gier w naszym kraju. Dzisiejsza odsłona dotyczy trzynastego tygodnia tego roku, czyli okresu od 28 marca do 3 kwietnia 2022 roku. W tym czasie na rodzimym rynku zapanowała stagnacja, gdyż pierwsza piątka największych bestsellerów była identyczna jak w dwunastym tygodniu roku. Liderem pozostało więc The Sims 4 , a za tytułem EA Maxis znalazły się w gry FIFA 22 , Elden Ring , Grand Theft Auto V oraz It Takes Two . Ciekawsze rzeczy działy się na niższych pozycjach. Do top 10 niespodziewanie wróciły bowiem gry Motorsport Manager oraz EA Sports UFC 4 , które od wielu miesięcy nie gościły w pierwszej dziesiątce. Przypominamy, że dane obejmują sprzedaż cyfrową i pudełkową – uzyskaliśmy je dzięki współpracy ze Stowarzyszeniem Producentów i Dystrybutorów Oprogramowania Rozrywkowego (SPiDOR). Ich źródłem jest organizacja Interactive Software Federation of Europe , co oznacza, że pochodzą bezpośrednio od największych branżowych wydawców i sieci sprzedaży detalicznej. ISFE – strona oficjalna SPiDOR – strona oficjalna Pozycja  Poprz.  tydz.  Tytuł  Platformy  Wydawca  Gatunek  Premiera  PEGI  1.  1.  The Sims 4  PC, PS4, XONE  Electronic Arts  Strategia  4.09.2014  12  2.  2.  FIFA 22  PC, PS4, XONE, PS5, XSX, Switch  Electronic Arts  Gra sportowa  27.09.2021  3  3.  3.  Elden Ring  PC, PS4, XONE, PS5, XSX  Bandai Namco Entertainment  RPG  25.02.2022  16  4.  4.  Grand Theft Auto V  PC, PS3, PS4, X360, XONE  Rockstar Games  Gra akcji  17.09.2013  18  5.  5.  It Takes Two  PC, PS4, XONE, PS5, XSX, Switch  Electronic Arts  Gra akcji  26.03.2021  16  6.  118.  Motorsport Manager  PC  Sega  Strategia  10.11.2016  12  7.  7.  Red Dead Redemption 2  PC, PS4, XONE  Rockstar Games  Gra akcji  26.10.2018  18  8.  9.  F1 2021  PC, PS4, XONE, PS5, XSX  Electronic Arts  Wyścigi  13.07.2021  3  9.  34.  EA Sports UFC 4  PS4, XONE  Electronic Arts  Bijatyka  14.08.2020  16  10.  12 .  Gran Turismo 7  PS4, PS5  Sony  Wyścigi  4.03.2022  3  *- w tabeli podajemy gatunki gier oraz platformy zgodnie z tym, co znaleźliśmy w danych SPiDOR.", "url": "https://www.gry-online.pl/newsroom/polacy-rzucili-sie-kupowac-motorsport-manager-top-10-w-polsce/z821a31"}
{"title": "Polacy wrócili na salony CSGO, choć finał ESL Pro League przegrali", "date": "11 kwietnia 2022, 13:19", "summary": "Za nami finał prestiżowego turnieju CSGO – ESL Pro League. W finale imprezy zespół ENCE z dwoma Polakami w składzie uległ Faze Clanowi 1:3. Pomimo porażki to najlepsze osiągnięcie polskich zawodników od bardzo długiego czasu.", "text": "Wczoraj po prawie pięciogodzinnym boju zakończył się finał prestiżowego turnieju ESL Pro League w Counter-Strike’u – Global Offensive . Rozgrywki , które rozpoczęły się ponad miesiąc temu, przypieczętowało starcie zespołu ENCE (z Olkiem „hadesem” Miśkieiwczem i Pawłem „dychą” Dychą w składzie) z Faze Clanem, zakończone wynikiem 1:3 (format Best of 5 – do trzech wygranych map). Pomimo porażki w finale ostateczny wynik drużyny polskiego duetu należy potraktować jak spory sukces. To pierwszy finał turnieju o tak dużej randze z udziałem Polaków od ponad czterech lat. Akronim, który nie tak dawno był niesamowicie popularny za sprawą poprzedniego składu ENCE, dziś ponownie może stać się aktualny. Co prawda mówi się, że druga pozycja to miejsce pierwsze wśród przegranych, ale zespół hadesa oraz Dychy, który nie był wymieniany w gronie faworytów do zwycięstwa, i tak poradził sobie znakomicie. ENCE w drodze do finału pokonało takie zespoły, jak Fnatic, Ninjas in Pyjamas czy nawet zwycięzców turnieju – Faze Clan (w fazie grupowej). Wydaje się, że polscy zawodnicy na dobre zadomowili się w światowej czołówce. Ostatnia taka sytuacja miała miejsce za czasów tzw. Złotej Piątki, grającej w barwach Virtus.Pro. Należy pochwalić również postawę jedynej rdzennie polskiej ekipy – x-kom AGO, która co prawda uplasowała się na miejscach 13–16. (4. miejsce w grupie D), ale podjęła walkę z dużo wyżej notowanymi rywalami, wygrywając dwa z pięciu spotkań grupowych. Być może „Jastrzębie”, które od jakiegoś czasu próbują się przebić do międzynarodowego „topu”, w końcu dopną swego. Wynik z piętnastej edycji ESL Pro League może napawać polskich kibiców optymizmem.", "url": "https://www.gry-online.pl/newsroom/polacy-wrocili-na-salony-csgo-ence-z-drugim-miejscem-w-esl-pro-le/za21a33"}
{"title": "Wiemy, w jakim okresie może ukazać się 3 sezon The Mandalorian", "date": "11 kwietnia 2022, 13:10", "summary": "Zdjęcia do trzeciego sezonu Star Wars: The Mandalorian zostały niedawno zakończone. Grający w serialu Giancarlo Esposito zdradza, kiedy możemy się go spodziewać.", "text": "Podczas występu w programie The Rich Eisen Show, aktor Giancarlo Esposito , który powraca jako Moff Gideon, zdradził, kiedy możemy spodziewać się premiery trzeciego sezonu  The Mandalorian . Twórcy , Jon Favreau i Dave Filoni , będą rozmawiać o przyszłości serialu podczas Mando+: A Conversation with Jon Favreau & Dave Filoni, panelu na konwencie Star Wars Celebration, który odbędzie się 28 maja. Twórca i showrunner Favreau oraz producent wykonawczy Filoni przedstawią, co nas czeka w trzecim sezonie serialu. Pierwsze dwa sezony   były naprawdę udane.  W latach 2020 i 2021 serial zdobył 14 nagród Emmy i aż 39 nominacji. Wiele postaci, które po raz pierwszy pojawiły się w tej produkcji, ma teraz własne spin-offy. Jak dotąd Disney+ i Lucasfilm nie skomentowały daty rozpoczęcia emisji nowych odcinków. Zdjęcia do nowego sezonu zakończyły się w połowie marca. Jeśli wszystko pójdzie zgodnie z planem, trzeci sezon serialu powinien być dostępny w serwisie streamingowym Disney+ najpóźniej pod koniec tego roku.", "url": "https://www.gry-online.pl/newsroom/the-mandalorian-sezon-3-wiemy-kiedy-moze-ukazac/zc21a2f"}
{"title": "Znany bohater Marvela może być przeciwnikiem w Black Panther 2", "date": "11 kwietnia 2022, 12:53", "summary": "Popularny informator podzielił się swoją wiedzą na temat filmu Black Panther 2. Zdradził, kto według niego będzie głównym antagonistą w produkcji.", "text": "Premiera Black Panther: Wakanda Forever , czyli sequela pierwszego filmu o Czarnej Panterze, odbędzie się jeszcze w tym roku, a dokładnie 11 listopada. Nadal nie wiemy jednak prawie nic na temat produkcji. W gruncie rzeczy nie zdradzono nawet, kto będzie głównym bohaterem filmu lub jego przeciwnikiem. Z pomocą w tej kwestii przychodzą doniesienia popularnego informatora. Podzielił się bowiem swoją wiedzą na temat antagonisty, którego mielibyśmy zobaczyć w . Według Charlesa Murphy’ego, czyli autora portalu Murphy’s Multiverse, głównym przeciwnikiem w nadchodzącym filmie będzie Namor. Jest on jedną z najstarszych postaci Marvela. Pojawia się na kartach komiksów od ponad 80 lat. Jego wątki często związane są bezpośrednio z Czarną Panterą. Namor jest bowiem królem Atlantydy, czyli mitycznego, podwodnego królestwa. Państwo to posiada zaś historię licznych konfliktów z Wakandą. Obecność Namora w wydaje się więc całkiem logiczna. Ponadto wiele osób od dłuższego czasu spekulowało, że to właśnie ta postać pojawi się w nadchodzącym filmie. W sieci pojawiły się zresztą pogłoski sugerujące, że aktorem, który miałby wcielić się w króla Atlantydy jest Tenoch Huerta. Jest to meksykański artysta znany m.in. z Narcos: Meksyk . Należy jednak wyraźnie zaznaczyć, że powyższe informacje są jedynie plotkami. Warto więc podchodzić do nich z odpowiednim dystansem.", "url": "https://www.gry-online.pl/newsroom/black-panther-2-informator-zdradza-kto-bedzie-antagonista-w-filmi/z721a30"}
{"title": "Stranger Things 4 niczym Gra o tron według twórców serialu", "date": "11 kwietnia 2022, 12:27", "summary": "Twórcy Stranger Things, bracia Duffer, opisali wyczekiwany czwarty sezon serialu jako ich wersję Gry o tron z uwagi na skalę opowiedzianej w nim historii.", "text": "Wszystko wskazuje na to, że wyczekiwany czwarty sezon Stranger Things opowie historię, której skala zrobi na nas wrażenie. Jak donosi serwis Deadline , fabuła kolejnego rozdziału ma być tak rozległa, że twórcy nazywają czwarty sezon “swoją Grą o tron”. Całość będzie podzielona na trzy główne wątki, a oprócz powrotu do Hawkins, bohaterowie serii odwiedzą pustynie słonecznej Kalifornii oraz rosyjską tundrę. Poniżej możecie przeczytać wspomniany wywiad z braćmi Duffer i Winoną Ryder . Poza obietnicami dotyczącymi odpowiedzi na dręczące nas pytania, bracia Duffer zdradzili również, że aby opowiedzieć historię o takiej skali, każdy z odcinków czwartego sezonu będzie liczył przynajmniej godzinę , a cały sezon jest prawie dwukrotnie dłuższy od poprzednich. Sądząc po wypowiedzi twórców, czwarty sezon znacznie rozbuduje uwielbiane uniwersum i poszerzy skalę opowiadanych w nim historii. Nareszcie uzyskamy odpowiedzi na niektóre pytania dotyczące świata po Drugiej stronie. Pierwsza część czwartego sezonu serialu zadebiutuje 27 maja, a na drugą przyjdzie nam poczekać do 1 lipca. Jak jest z Wami? Podoba Wam się pomysł poszerzenia skali tego uniwersum, czy może wolelibyście, by pozostało bardziej kameralne?", "url": "https://www.gry-online.pl/newsroom/stranger-things-4-niczym-gra-o-tron-wedlug-tworcow-serialu/zb21a2e"}
{"title": "13 najdziwniejszych telefonów komórkowych w historii", "date": "27 sierpnia 2021, 14:40", "summary": "Patrząc na współczesne smartfony można odnieść wrażenie, że producenci postawili na nudny design. Trudno pomyśleć, że jeszcze stosunkowo niedawno, twórcy potrafili zaskoczyć nietuzinkowymi rozwiązaniami i szalonymi pomysłami.", "text": "Życie bez smartfona w obecnych czasach byłoby dla wielu z pewnością niemożliwe. Te kieszonkowe urządzenia zadomowiły się w naszym codziennym życiu, niejednokrotnie ułatwiając wykonywanie niektórych czynności. Wydaje się jednak, że producenci smartfonów spoczęli na laurach i zaczęli tworzyć telefony bliźniaczo do siebie podobne. Osoby nie interesujące się tym tematem na pewno mogą mieć problem w odróżnieniu kilku modeli smartfonów, które różnią się od siebie jedynie detalami i logiem producenta. Owszem, na przestrzeni ostatnich kilku lat twórcy starali się urozmaicić design, jednak obecnie na rynku nie doświadczymy, może poza kilkoma wyjątkami, telefonu wyróżniającego się wśród konkurencji. Fakt, że osoby odpowiedzialne za nowe konstrukcje smartfonów starają się zerwać z ogarniającą nas rutyną, jednak telefony ze zginanym wyświetlaczem czy wysuwanymi aparatami do selfie nie należą jeszcze do popularnych. Dlatego też trudno uwierzyć, że stosunkowo niedawno projektanci smartfonów potrafili mieć fantazję. Na rynku pojawiło się wiele abstrakcyjnych telefonów, które do dzisiaj potrafią zaskoczyć swoim wyglądem i wywołać uśmiech na twarzy. W dzisiejszych czasach dla zwykłego użytkownika bardziej liczą się ogromne liczby w benchmarkach, aniżeli wyróżniający się design. Jednak patrząc na niektóre rozwiązania warto się zastanowić, czy obecnie chcielibyśmy mieć możliwość zakupienia podobnie wyglądających smartfonów? Pierwszy telefon na liście na pewno zasługuje na zaszczytne miejsce w rankingu najdziwniejszych komórek. Jak inaczej nazwać urządzenie, które swoim wyglądem do złudzenia przypomina opakowanie wyrobów tytoniowych jednej z popularnych marek? Taki właśnie jest Yan Wang 3838. Jest to idealny telefon dla fanów palenia, bowiem producent zdecydował się na umieszczenie specjalnego miejsca do przechowywania papierosów pod tylną klapką. Zamiast paczki „fajek”, wystarczyło nosić ze sobą ten telefon, który był w stanie pomieścić ich 10 sztuk. Pożyteczne prawda? Nie bardzo, tytoń szkodzi zdrowiu.", "url": "https://www.gry-online.pl/S018.asp?ID=3096"}
{"title": "Po co nam w telefonie mocny procesor?", "date": "8 kwietnia 2022, 14:40", "summary": "W ostatnich latach tańsze smartfony robią prawdziwą furorę. Oferują coraz więcej funkcji w przystępnej cenie. Dlaczego więc spora część z nas wybiera flagowce? Zobaczcie pięć powodów, dla których nadal lubimy drogie i wydajne telefony.", "text": "Flagowe smartfony to prawdziwy pokaz mody, urządzenia pozwalające pokazywać producentom swoje najlepsze cechy, prężyć muskuły i z dumą podkreślać „jesteśmy najlepsi”. Nie da się jednak nie zauważyć, że ich ceny od jakiegoś czasu zaczęły mocno piąć się w górę, a konkurencja w postaci bardziej budżetowych rozwiązań z każdym miesiącem staje się coraz silniejsza. Smartfony z niższej i średniej półki cenowej przeszły naprawdę długą drogę i oferują całkiem sensowny kompromis pomiędzy ceną i wydajnością. Są jednak takie zastosowania, do których słabsze urządzenia po prostu się nie nadają. Z poniższego artykułu dowiecie się, dlaczego nadal warto kupować flagowce z mocnymi procesorami, szczególnie jeśli lubicie mobilne granie . Jeśli interesuje Was granie na telefonie, to pewnie wiecie, że w wymagających tytułach pokroju ,  czy każdy FPS ma znaczenie. Im płynniejsza rozgrywka, tym większa szansa na sukces. Jasno trzeba sobie powiedzieć, że to właśnie procesory umieszczane we flagowcach gwarantują najlepsze osiągi w grach. W przypadku jednostek ze średniej półki cenowej niemal w każdej produkcji musicie liczyć się z pewnymi ograniczeniami i zostaniecie zmuszeni do obniżenia ustawień graficznych, albo zabawy z mniejszą liczbą FPS-ów. Jeśli wybierzecie flagowca, to o żadnych kompromisach nie będzie mowy – po prostu ustawicie wszystkie detale na maksa i możecie cieszyć się płynną rozgrywką bez obaw o zbyt niską liczbę klatek na sekundę. Żeby nie być gołosłownym, przetestowałem wymienione wcześniej gry na flagowej motoroli edge 30 pro, wyposażonej w jeden z najlepszych procesorów na rynku - Snapdragona 8 Gen 1 od Qualcomma. Ten w połączeniu z układem graficznym Adreno 730 i 12 GB pamięci RAM nie sprawiał żadnych problemów z rozgrywką. na maksymalnych ustawieniach trzymał stałe 60 FPS-ów, tak samo było w przypadku w trybie HDR i na nastawie „epickiej” . Ani razu nie uświadczyłem zauważalnych spadków płynności, nawet z włączonym nagrywaniem obrazu na żywo, choć przyznam, że czasem sprzęt robił się ciepły. Nie w takim stopniu oczywiście, jak tańsze telefony z prostszymi i starszymi układami graficznymi. Tam należy nastawić się na dużo niższy komfort rozgrywki i regularne spadki FPS-ów.", "url": "https://www.gry-online.pl/S018.asp?ID=3469"}
{"title": "Sketches of Glory", "date": "None", "summary": "Komiks: Easy horror z serii Sketches of Glory, odc. 17, autor: Filip Sulkovsky", "text": "", "url": "https://www.gry-online.pl/komiksy/sketches-of-glory/sketches-of-glory-odc-17-easy-horror/z11fbec"}
{"title": "Najlepsze gry na telefon 2021 roku - wybór redakcji", "date": "27 grudnia 2021, 13:07", "summary": "Dobiegający końca rok okazał się kolejnym udanym dla gier mobilnych. Na rynek trafiło całe mnóstwo nowych produkcji, toteż wybranie spośród nich czołowej dziesiątki nie było łatwe.", "text": "Na naszej liście najlepszych mobilnych premier 2021 każdy powinien znaleźć coś dla siebie. Wśród wytypowanych przebojów są gry free-to-play oraz premium. Tytuły opracowane od zera z myślą o smartfonach i tabletach, pozycje przekonwertowane z pecetów i konsol, jak i projekty pośrednie – które bazują na istniejących hitach, ale przeszły dużą metamorfozę, żeby idealnie pasować do zabawy na ekranach dotykowych. Pod koniec tego roku na rynek powrócił pionier kategorii łączącej gry match-3 z elementami RPG. na razie dostępny jest w Early Accessie, ale już teraz oferuje zawartość i stopień dopracowania na poziomie pełnych wersji. Podstawowe mechanizmy zabawy są tradycyjne dla tej kategorii. Zajmujemy się więc toczeniem bitew poprzez tworzenie ciągów przynajmniej trzech symboli tego samego typu z zestawów rozrzuconych po planszy. Im dłuższa kombinacja, tym silniejszy efekt. Obudowano to jednak znacznie mocniejszymi elementami RPG niż zazwyczaj. Gra oferuje kilkaset misji i masę lochów do zwiedzania. Mechanika match-3 jest bardziej skomplikowana, a różne ciągi symboli pozwalają ładować zaklęcia i dopasowywać ataki do wrogów. Rozpoczynając zabawę, gracz może wybrać między kilkoma klasami, a potem rozwijać swojego bohatera za pomocą punktów doświadczenia. Poza samotną zabawą dostępne są także potyczki PvP. Do tego to rzadki przypadek produkcji z tego gatunku z grafiką 3D, choć wykonaną w stylu zachowującym klimat poprzednich odsłon. Wszystko to sprawia, że już teraz jest to jedna z najlepszych hybryd match-3 oraz RPG na rynku i definitywnie najciekawsza z tych, które zadebiutowały w 2021 roku. Więcej o grze Puzzle Quest 3", "url": "https://www.gry-online.pl/S018.asp?ID=3287"}
{"title": "Sketches of Glory", "date": "None", "summary": "Komiks: Lelele z serii Sketches of Glory, odc. 18, autor: Filip Sulkovsky", "text": "", "url": "https://www.gry-online.pl/komiksy/sketches-of-glory/sketches-of-glory-odc-18-lelele/z81ff9b"}
{"title": "Sketches of Glory", "date": "None", "summary": "Komiks: Pierwszy level, pierwszy boss z serii Sketches of Glory, odc. 19, autor: Filip Sulkovsky", "text": "", "url": "https://www.gry-online.pl/komiksy/sketches-of-glory/sketches-of-glory-odc-19-pierwszy-level-pierwszy-boss/zf201e7"}
{"title": "Sketches of Glory", "date": "None", "summary": "Komiks: Pierwszy kłest z serii Sketches of Glory, odc. 20, autor: Filip Sulkovsky", "text": "", "url": "https://www.gry-online.pl/komiksy/sketches-of-glory/sketches-of-glory-odc-20-pierwszy-klest/z020338"}
{"title": "Sketches of Glory", "date": "None", "summary": "Komiks: Drakesang z serii Sketches of Glory, odc. 21, autor: Filip Sulkovsky", "text": "", "url": "https://www.gry-online.pl/komiksy/sketches-of-glory/sketches-of-glory-odc-21-drakesang/z22046f"}
{"title": "Sketches of Glory", "date": "None", "summary": "Komiks: Ludzi poziom z serii Sketches of Glory, odc. 23, autor: Filip Sulkovsky", "text": "", "url": "https://www.gry-online.pl/komiksy/sketches-of-glory/sketches-of-glory-odc-23-ludzi-poziom/z020842"}
{"title": "Sketches of Glory", "date": "None", "summary": "Komiks: Wiedźmakowe style z serii Sketches of Glory, odc. 22, autor: Filip Sulkovsky", "text": "", "url": "https://www.gry-online.pl/komiksy/sketches-of-glory/sketches-of-glory-odc-22-wiedzmakowe-style/zd205b4"}
{"title": "Sketches of Glory", "date": "None", "summary": "Komiks: Przepotężny z serii Sketches of Glory, odc. 24, autor: Filip Sulkovsky", "text": "", "url": "https://www.gry-online.pl/komiksy/sketches-of-glory/sketches-of-glory-odc-24-przepotezny/ze20a29"}
{"title": "Sketches of Glory", "date": "None", "summary": "Komiks: CJ z serii Sketches of Glory, odc. 25, autor: Filip Sulkovsky", "text": "", "url": "https://www.gry-online.pl/komiksy/sketches-of-glory/sketches-of-glory-odc-25-cj/z820c12"}
{"title": "Sketches of Glory", "date": "None", "summary": "Komiks: God mode z serii Sketches of Glory, odc. 26, autor: Filip Sulkovsky", "text": "", "url": "https://www.gry-online.pl/komiksy/sketches-of-glory/sketches-of-glory-odc-26-god-mode/zc20d60"}
{"title": "Sketches of Glory", "date": "None", "summary": "Komiks: Twarde prawo z serii Sketches of Glory, odc. 27, autor: Filip Sulkovsky", "text": "", "url": "https://www.gry-online.pl/komiksy/sketches-of-glory/fatal-draws-odc-155-twarde-prawo/zd20ebd"}
